Охотники_и_рыболовы/src/Documents/УстановкаНеучтеннойДичи/УстановкаНеучтеннойДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаНеучтеннойДичи</name>
  <registerRecords>InformationRegister.Ограничение</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НеучтеннаяДичь</name>
    <attributes>
      <name>Охотхозяйство</name>
      <type>
        <types>CatalogRef.Охотхозяйства</types>
      </type>
    </attributes>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/Ограничение/Ограничение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Ограничение</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Охотхозяйство</name>
    <type>
      <types>CatalogRef.Охотхозяйства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Documents/УстановкаНеучтеннойДичи/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Ограничение.Очистить();
	Движения.Ограничение.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	  "ВЫБРАТЬ
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка.СезонОхоты.ДатаНачала КАК Период,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Охотхозяйство.Ссылка КАК Охотхозяйство,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка.СезонОхоты.Ссылка КАК СезонОхоты,
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Дичь
	 |ИЗ
	 |	Документ.УстановкаНеучтеннойДичи.НеучтеннаяДичь КАК УстановкаНеучтеннойДичиНеучтеннаяДичь
	 |ГДЕ
	 |	УстановкаНеучтеннойДичиНеучтеннаяДичь.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Движения.Ограничение.Загрузить(Результат.Выгрузить());
		Движения.Записать();
	КонецЕсли;

КонецПроцедуры
